; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_11_20)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 - boat
		p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 - person
	)

  (:init
		(= (x b0) 5)
(= (y b0) 0)
(= (x b1) 10)
(= (y b1) 0)
(= (x b2) -3)
(= (y b2) 0)
(= (x b3) -2)
(= (y b3) 0)
(= (x b4) -3)
(= (y b4) 0)
(= (x b5) 0)
(= (y b5) 0)
(= (x b6) -1)
(= (y b6) 0)
(= (x b7) -8)
(= (y b7) 0)
(= (x b8) 5)
(= (y b8) 0)
(= (x b9) -7)
(= (y b9) 0)
(= (x b10) -1)
(= (y b10) 0)

		(= (d p0) 34)
(= (d p1) 28)
(= (d p2) 70)
(= (d p3) 74)
(= (d p4) 83)
(= (d p5) 35)
(= (d p6) 7)
(= (d p7) 90)
(= (d p8) 90)
(= (d p9) 75)
(= (d p10) 47)
(= (d p11) 9)
(= (d p12) 64)
(= (d p13) 87)
(= (d p14) 82)
(= (d p15) 0)
(= (d p16) 83)
(= (d p17) 64)
(= (d p18) 25)
(= (d p19) 77)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
(saved p4)
(saved p5)
(saved p6)
(saved p7)
(saved p8)
(saved p9)
(saved p10)
(saved p11)
(saved p12)
(saved p13)
(saved p14)
(saved p15)
(saved p16)
(saved p17)
(saved p18)
(saved p19)
		)
	)
)

; plan
1. (go_north_east b5)
   changed: (x b5) from 0 to 1.5, (y b5) from 0 to 1.5
   goals met: 0 of 20
2. (go_north_east b5)
   changed: (x b5) from 1.5 to 3, (y b5) from 1.5 to 3
   goals met: 0 of 20
3. (go_north_east b5)
   changed: (x b5) from 3 to 4.5, (y b5) from 3 to 4.5
   goals met: 0 of 20
4. (go_north_east b5)
   changed: (x b5) from 4.5 to 6, (y b5) from 4.5 to 6
   goals met: 0 of 20
5. (go_north_east b5)
   changed: (x b5) from 6 to 7.5, (y b5) from 6 to 7.5
   goals met: 0 of 20
6. (go_north_east b5)
   changed: (x b5) from 7.5 to 9, (y b5) from 7.5 to 9
   goals met: 0 of 20
7. (go_north_east b5)
   changed: (x b5) from 9 to 10.5, (y b5) from 9 to 10.5
   goals met: 0 of 20
8. (go_north_east b5)
   changed: (x b5) from 10.5 to 12, (y b5) from 10.5 to 12
   goals met: 0 of 20
9. (go_north_east b5)
   changed: (x b5) from 12 to 13.5, (y b5) from 12 to 13.5
   goals met: 0 of 20
10. (go_north_east b5)
   changed: (x b5) from 13.5 to 15, (y b5) from 13.5 to 15
   goals met: 0 of 20
11. (go_north_west b5)
   changed: (x b5) from 15 to 13.5, (y b5) from 15 to 16.5
   goals met: 0 of 20
12. (go_north_west b5)
   changed: (x b5) from 13.5 to 12, (y b5) from 16.5 to 18
   goals met: 0 of 20
13. (go_north_west b5)
   changed: (x b5) from 12 to 10.5, (y b5) from 18 to 19.5
   goals met: 0 of 20
14. (save_person b5 p6)
   added: (saved p6)
   goals met: 1 of 20
15. (save_person b5 p11)
   added: (saved p11)
   goals met: 2 of 20
16. (go_north_east b5)
   changed: (x b5) from 10.5 to 12, (y b5) from 19.5 to 21
   goals met: 2 of 20
17. (go_north_east b5)
   changed: (x b5) from 12 to 13.5, (y b5) from 21 to 22.5
   goals met: 2 of 20
18. (go_north_east b5)
   changed: (x b5) from 13.5 to 15, (y b5) from 22.5 to 24
   goals met: 2 of 20
19. (go_north_east b5)
   changed: (x b5) from 15 to 16.5, (y b5) from 24 to 25.5
   goals met: 2 of 20
20. (go_north_east b5)
   changed: (x b5) from 16.5 to 18, (y b5) from 25.5 to 27
   goals met: 2 of 20
21. (go_north_east b5)
   changed: (x b5) from 18 to 19.5, (y b5) from 27 to 28.5
   goals met: 2 of 20
22. (go_north_east b5)
   changed: (x b5) from 19.5 to 21, (y b5) from 28.5 to 30
   goals met: 2 of 20
23. (go_north_east b5)
   changed: (x b5) from 21 to 22.5, (y b5) from 30 to 31.5
   goals met: 2 of 20
24. (go_north_east b5)
   changed: (x b5) from 22.5 to 24, (y b5) from 31.5 to 33
   goals met: 2 of 20
25. (go_north_east b5)
   changed: (x b5) from 24 to 25.5, (y b5) from 33 to 34.5
   goals met: 2 of 20
26. (go_north_east b5)
   changed: (x b5) from 25.5 to 27, (y b5) from 34.5 to 36
   goals met: 2 of 20
27. (go_north_east b5)
   changed: (x b5) from 27 to 28.5, (y b5) from 36 to 37.5
   goals met: 2 of 20
28. (go_west b5)
   changed: (x b5) from 28.5 to 25.5
   goals met: 2 of 20
29. (go_west b5)
   changed: (x b5) from 25.5 to 22.5
   goals met: 2 of 20
30. (go_west b5)
   changed: (x b5) from 22.5 to 19.5
   goals met: 2 of 20
31. (go_west b5)
   changed: (x b5) from 19.5 to 16.5
   goals met: 2 of 20
32. (go_west b5)
   changed: (x b5) from 16.5 to 13.5
   goals met: 2 of 20
33. (go_west b5)
   changed: (x b5) from 13.5 to 10.5
   goals met: 2 of 20
34. (go_north_east b5)
   changed: (x b5) from 10.5 to 12, (y b5) from 37.5 to 39
   goals met: 2 of 20
35. (go_north_east b5)
   changed: (x b5) from 12 to 13.5, (y b5) from 39 to 40.5
   goals met: 2 of 20
36. (go_north_east b5)
   changed: (x b5) from 13.5 to 15, (y b5) from 40.5 to 42
   goals met: 2 of 20
37. (go_north_east b5)
   changed: (x b5) from 15 to 16.5, (y b5) from 42 to 43.5
   goals met: 2 of 20
38. (go_north_east b5)
   changed: (x b5) from 16.5 to 18, (y b5) from 43.5 to 45
   goals met: 2 of 20
39. (go_north_east b5)
   changed: (x b5) from 18 to 19.5, (y b5) from 45 to 46.5
   goals met: 2 of 20
40. (go_north_west b5)
   changed: (x b5) from 19.5 to 18, (y b5) from 46.5 to 48
   goals met: 2 of 20
41. (go_north_west b5)
   changed: (x b5) from 18 to 16.5, (y b5) from 48 to 49.5
   goals met: 2 of 20
42. (go_north_west b5)
   changed: (x b5) from 16.5 to 15, (y b5) from 49.5 to 51
   goals met: 2 of 20
43. (go_west b5)
   changed: (x b5) from 15 to 12
   goals met: 2 of 20
44. (go_west b5)
   changed: (x b5) from 12 to 9
   goals met: 2 of 20
45. (go_west b5)
   changed: (x b5) from 9 to 6
   goals met: 2 of 20
46. (go_west b5)
   changed: (x b5) from 6 to 3
   goals met: 2 of 20
47. (save_person b5 p0)
   added: (saved p0)
   goals met: 3 of 20
48. (save_person b5 p5)
   added: (saved p5)
   goals met: 4 of 20
49. (save_person b5 p10)
   added: (saved p10)
   goals met: 5 of 20
50. (go_north_east b6)
   changed: (x b6) from -1 to 0.5, (y b6) from 0 to 1.5
   goals met: 5 of 20
51. (save_person b6 p15)
   added: (saved p15)
   goals met: 6 of 20
52. (go_north_east b5)
   changed: (x b5) from 3 to 4.5, (y b5) from 51 to 52.5
   goals met: 6 of 20
53. (go_north_east b5)
   changed: (x b5) from 4.5 to 6, (y b5) from 52.5 to 54
   goals met: 6 of 20
54. (go_north_east b5)
   changed: (x b5) from 6 to 7.5, (y b5) from 54 to 55.5
   goals met: 6 of 20
55. (go_north_east b5)
   changed: (x b5) from 7.5 to 9, (y b5) from 55.5 to 57
   goals met: 6 of 20
56. (go_north_west b5)
   changed: (x b5) from 9 to 7.5, (y b5) from 57 to 58.5
   goals met: 6 of 20
57. (go_north_west b5)
   changed: (x b5) from 7.5 to 6, (y b5) from 58.5 to 60
   goals met: 6 of 20
58. (go_west b5)
   changed: (x b5) from 6 to 3
   goals met: 6 of 20
59. (go_west b5)
   changed: (x b5) from 3 to 0
   goals met: 6 of 20
60. (go_west b5)
   changed: (x b5) from 0 to -3
   goals met: 6 of 20
61. (go_west b5)
   changed: (x b5) from -3 to -6
   goals met: 6 of 20
62. (go_north_east b5)
   changed: (x b5) from -6 to -4.5, (y b5) from 60 to 61.5
   goals met: 6 of 20
63. (go_north_east b5)
   changed: (x b5) from -4.5 to -3, (y b5) from 61.5 to 63
   goals met: 6 of 20
64. (go_north_east b5)
   changed: (x b5) from -3 to -1.5, (y b5) from 63 to 64.5
   goals met: 6 of 20
65. (go_north_east b5)
   changed: (x b5) from -1.5 to 0, (y b5) from 64.5 to 66
   goals met: 6 of 20
66. (save_person b5 p12)
   added: (saved p12)
   goals met: 7 of 20
67. (save_person b5 p17)
   added: (saved p17)
   goals met: 8 of 20
68. (go_north_east b5)
   changed: (x b5) from 0 to 1.5, (y b5) from 66 to 67.5
   goals met: 8 of 20
69. (go_north_east b5)
   changed: (x b5) from 1.5 to 3, (y b5) from 67.5 to 69
   goals met: 8 of 20
70. (go_north_east b5)
   changed: (x b5) from 3 to 4.5, (y b5) from 69 to 70.5
   goals met: 8 of 20
71. (go_north_east b5)
   changed: (x b5) from 4.5 to 6, (y b5) from 70.5 to 72
   goals met: 8 of 20
72. (go_north_west b5)
   changed: (x b5) from 6 to 4.5, (y b5) from 72 to 73.5
   goals met: 8 of 20
73. (go_north_west b5)
   changed: (x b5) from 4.5 to 3, (y b5) from 73.5 to 75
   goals met: 8 of 20
74. (save_person b5 p2)
   added: (saved p2)
   goals met: 9 of 20
75. (go_north_west b5)
   changed: (x b5) from 3 to 1.5, (y b5) from 75 to 76.5
   goals met: 9 of 20
76. (save_person b5 p3)
   added: (saved p3)
   goals met: 10 of 20
77. (save_person b5 p9)
   added: (saved p9)
   goals met: 11 of 20
78. (go_north_west b5)
   changed: (x b5) from 1.5 to 0, (y b5) from 76.5 to 78
   goals met: 11 of 20
79. (save_person b5 p19)
   added: (saved p19)
   goals met: 12 of 20
80. (go_north_west b5)
   changed: (x b5) from 0 to -1.5, (y b5) from 78 to 79.5
   goals met: 12 of 20
81. (go_south b5)
   changed: (y b5) from 79.5 to 77.5
   goals met: 12 of 20
82. (go_north_east b5)
   changed: (x b5) from -1.5 to 0, (y b5) from 77.5 to 79
   goals met: 12 of 20
83. (go_north_east b5)
   changed: (x b5) from 0 to 1.5, (y b5) from 79 to 80.5
   goals met: 12 of 20
84. (go_north_west b5)
   changed: (x b5) from 1.5 to 0, (y b5) from 80.5 to 82
   goals met: 12 of 20
85. (save_person b5 p14)
   added: (saved p14)
   goals met: 13 of 20
86. (go_south_east b5)
   changed: (x b5) from 0 to -2, (y b5) from 82 to 80
   goals met: 13 of 20
87. (go_south_east b5)
   changed: (x b5) from -2 to -4, (y b5) from 80 to 78
   goals met: 13 of 20
88. (go_south_west b5)
   changed: (x b5) from -4 to -2, (y b5) from 78 to 76
   goals met: 13 of 20
89. (go_south_west b5)
   changed: (x b5) from -2 to 0, (y b5) from 76 to 74
   goals met: 13 of 20
90. (go_south_west b5)
   changed: (x b5) from 0 to 2, (y b5) from 74 to 72
   goals met: 13 of 20
91. (go_south_west b5)
   changed: (x b5) from 2 to 4, (y b5) from 72 to 70
   goals met: 13 of 20
92. (go_south_west b5)
   changed: (x b5) from 4 to 6, (y b5) from 70 to 68
   goals met: 13 of 20
93. (go_south_west b5)
   changed: (x b5) from 6 to 8, (y b5) from 68 to 66
   goals met: 13 of 20
94. (go_south_west b5)
   changed: (x b5) from 8 to 10, (y b5) from 66 to 64
   goals met: 13 of 20
95. (go_south_west b5)
   changed: (x b5) from 10 to 12, (y b5) from 64 to 62
   goals met: 13 of 20
96. (go_south b5)
   changed: (y b5) from 62 to 60
   goals met: 13 of 20
97. (go_north_east b5)
   changed: (x b5) from 12 to 13.5, (y b5) from 60 to 61.5
   goals met: 13 of 20
98. (go_south_east b5)
   changed: (x b5) from 13.5 to 11.5, (y b5) from 61.5 to 59.5
   goals met: 13 of 20
99. (go_south_east b5)
   changed: (x b5) from 11.5 to 9.5, (y b5) from 59.5 to 57.5
   goals met: 13 of 20
100. (go_south_east b5)
   changed: (x b5) from 9.5 to 7.5, (y b5) from 57.5 to 55.5
   goals met: 13 of 20
101. (go_south_east b5)
   changed: (x b5) from 7.5 to 5.5, (y b5) from 55.5 to 53.5
   goals met: 13 of 20
102. (go_south_east b5)
   changed: (x b5) from 5.5 to 3.5, (y b5) from 53.5 to 51.5
   goals met: 13 of 20
103. (go_south_east b5)
   changed: (x b5) from 3.5 to 1.5, (y b5) from 51.5 to 49.5
   goals met: 13 of 20
104. (save_person b5 p1)
   added: (saved p1)
   goals met: 14 of 20
105. (go_north_east b5)
   changed: (x b5) from 1.5 to 3, (y b5) from 49.5 to 51
   goals met: 14 of 20
106. (go_north_west b5)
   changed: (x b5) from 3 to 1.5, (y b5) from 51 to 52.5
   goals met: 14 of 20
107. (go_north_west b5)
   changed: (x b5) from 1.5 to 0, (y b5) from 52.5 to 54
   goals met: 14 of 20
108. (go_north_east b5)
   changed: (x b5) from 0 to 1.5, (y b5) from 54 to 55.5
   goals met: 14 of 20
109. (go_north_east b5)
   changed: (x b5) from 1.5 to 3, (y b5) from 55.5 to 57
   goals met: 14 of 20
110. (go_north_east b5)
   changed: (x b5) from 3 to 4.5, (y b5) from 57 to 58.5
   goals met: 14 of 20
111. (go_north_east b5)
   changed: (x b5) from 4.5 to 6, (y b5) from 58.5 to 60
   goals met: 14 of 20
112. (go_north_east b5)
   changed: (x b5) from 6 to 7.5, (y b5) from 60 to 61.5
   goals met: 14 of 20
113. (go_north_east b5)
   changed: (x b5) from 7.5 to 9, (y b5) from 61.5 to 63
   goals met: 14 of 20
114. (go_north_east b5)
   changed: (x b5) from 9 to 10.5, (y b5) from 63 to 64.5
   goals met: 14 of 20
115. (go_north_east b5)
   changed: (x b5) from 10.5 to 12, (y b5) from 64.5 to 66
   goals met: 14 of 20
116. (go_north_west b5)
   changed: (x b5) from 12 to 10.5, (y b5) from 66 to 67.5
   goals met: 14 of 20
117. (go_north_west b5)
   changed: (x b5) from 10.5 to 9, (y b5) from 67.5 to 69
   goals met: 14 of 20
118. (go_north_west b5)
   changed: (x b5) from 9 to 7.5, (y b5) from 69 to 70.5
   goals met: 14 of 20
119. (go_north_west b5)
   changed: (x b5) from 7.5 to 6, (y b5) from 70.5 to 72
   goals met: 14 of 20
120. (go_north_west b5)
   changed: (x b5) from 6 to 4.5, (y b5) from 72 to 73.5
   goals met: 14 of 20
121. (go_north_west b5)
   changed: (x b5) from 4.5 to 3, (y b5) from 73.5 to 75
   goals met: 14 of 20
122. (go_north_west b5)
   changed: (x b5) from 3 to 1.5, (y b5) from 75 to 76.5
   goals met: 14 of 20
123. (go_north_west b5)
   changed: (x b5) from 1.5 to 0, (y b5) from 76.5 to 78
   goals met: 14 of 20
124. (go_north_west b5)
   changed: (x b5) from 0 to -1.5, (y b5) from 78 to 79.5
   goals met: 14 of 20
125. (go_north_east b5)
   changed: (x b5) from -1.5 to 0, (y b5) from 79.5 to 81
   goals met: 14 of 20
126. (go_north_east b5)
   changed: (x b5) from 0 to 1.5, (y b5) from 81 to 82.5
   goals met: 14 of 20
127. (go_north_east b6)
   changed: (x b6) from 0.5 to 2, (y b6) from 1.5 to 3
   goals met: 14 of 20
128. (go_north_east b6)
   changed: (x b6) from 2 to 3.5, (y b6) from 3 to 4.5
   goals met: 14 of 20
129. (go_north_east b6)
   changed: (x b6) from 3.5 to 5, (y b6) from 4.5 to 6
   goals met: 14 of 20
130. (go_north_east b6)
   changed: (x b6) from 5 to 6.5, (y b6) from 6 to 7.5
   goals met: 14 of 20
131. (go_north_east b6)
   changed: (x b6) from 6.5 to 8, (y b6) from 7.5 to 9
   goals met: 14 of 20
132. (go_north_east b6)
   changed: (x b6) from 8 to 9.5, (y b6) from 9 to 10.5
   goals met: 14 of 20
133. (go_north_east b6)
   changed: (x b6) from 9.5 to 11, (y b6) from 10.5 to 12
   goals met: 14 of 20
134. (go_north_east b6)
   changed: (x b6) from 11 to 12.5, (y b6) from 12 to 13.5
   goals met: 14 of 20
135. (go_north_west b5)
   changed: (x b5) from 1.5 to 0, (y b5) from 82.5 to 84
   goals met: 14 of 20
136. (save_person b5 p4)
   added: (saved p4)
   goals met: 15 of 20
137. (save_person b5 p16)
   added: (saved p16)
   goals met: 16 of 20
138. (go_north_east b5)
   changed: (x b5) from 0 to 1.5, (y b5) from 84 to 85.5
   goals met: 16 of 20
139. (go_north_east b5)
   changed: (x b5) from 1.5 to 3, (y b5) from 85.5 to 87
   goals met: 16 of 20
140. (go_north_west b5)
   changed: (x b5) from 3 to 1.5, (y b5) from 87 to 88.5
   goals met: 16 of 20
141. (save_person b5 p13)
   added: (saved p13)
   goals met: 17 of 20
142. (go_north_west b5)
   changed: (x b5) from 1.5 to 0, (y b5) from 88.5 to 90
   goals met: 17 of 20
143. (save_person b5 p7)
   added: (saved p7)
   goals met: 18 of 20
144. (save_person b5 p8)
   added: (saved p8)
   goals met: 19 of 20
145. (go_north_west b6)
   changed: (x b6) from 12.5 to 11, (y b6) from 13.5 to 15
   goals met: 19 of 20
146. (go_north_west b6)
   changed: (x b6) from 11 to 9.5, (y b6) from 15 to 16.5
   goals met: 19 of 20
147. (go_north_west b6)
   changed: (x b6) from 9.5 to 8, (y b6) from 16.5 to 18
   goals met: 19 of 20
148. (go_north_west b6)
   changed: (x b6) from 8 to 6.5, (y b6) from 18 to 19.5
   goals met: 19 of 20
149. (go_north_west b6)
   changed: (x b6) from 6.5 to 5, (y b6) from 19.5 to 21
   goals met: 19 of 20
150. (go_north_west b6)
   changed: (x b6) from 5 to 3.5, (y b6) from 21 to 22.5
   goals met: 19 of 20
151. (go_north_west b6)
   changed: (x b6) from 3.5 to 2, (y b6) from 22.5 to 24
   goals met: 19 of 20
152. (go_north_west b6)
   changed: (x b6) from 2 to 0.5, (y b6) from 24 to 25.5
   goals met: 19 of 20
153. (save_person b6 p18)
   added: (saved p18)
   goals met: 20 of 20
